Repository: yushapiumal/nitmo_qfix
Catalog: lib/l10n/app_*.arb
Languages: si

# language
source: English
si: සිංහල

source: Company Code
si: ආයතන කේතය

source: Login
si: ලොග් වන්න

source: Checking
si: රැදීසිටින්න

source: ALL
si: සියලු

source: OPEN
si: විවෘත

source: PRIORITY
si: ප්රමුඛත්වය

source: MINE
si: මගේ

source: Name
si: නම

source: S.ID
si: අංකය

# intext
source: IN
si: පැමිණීම :

source: OUT
si: පිටවීම :

# errorCompanyCode
source: Company code is required
si: සමාගම් කේතය අවශ්‍යයි

# errorUsername
source: Please enter username
si: කරුණාකර පරිශීලක නාමය ඇතුලත් කරන්න

# errorPassword
source: Please enter password
si: කරුණාකර මුරපදය ඇතුළත් කරන්න

# errorEmail
source: Please enter correct email address
si: කරුණාකර නිවැරදි ඊමේල් ලිපිනය ඇතුලත් කරන්න

source: Username
si: පරිශීලක නාමය

source: Password
si: මුරපදය

source: Forgot Password?
si: මුරපදය අමතක වුණා ද?

source: Contact administrator
si: තාක්ෂණික සහය ඉල්ලන්න

source: Customer Service
si: පාරිභෝගික සේවා

source: Inventory Control
si: භාණ්ඩ පාලනය

source: ATTENDANCE
si: පැමිණීම්

source: Settings
si: සැකසුම්

source: About
si: අප ගැන

source: Logout
si: ලොග් අවුට්

source: Are you sure?
si: ඔබට විශ්වාස ද?

# doyouwantlogout
source: Do you want to logout
si: ඔබට ඉවත් වීමට අවශ්‍යද

source: Yes
si: ඔව්

source: No
si: නැත

# permissionError
source: You do not have permission
si: ඔබට අවසර නැත

source: Site
si: සයිට්

source: Work
si: කාර්ය

source: Parts
si: කොටස්

# detailsScreen
source: Do you want to go details screen
si: විස්තර පිටුව

source: Timeline
si: කාලරාමුව

source: Issue / Task
si: ප්‍රශ්නය

source: Solution
si: විසඳුම

source: Technician's
si: ටෙක්නීෂියන්ගේ

source: Customer
si: පාරිභෝගිකයා

source: Assigned To
si: පවරා ඇතතේ

source: Owner
si: හිමිකරු

source: CANCEL
si: අවලංගු කර...

source: SUBMIT
si: යොමු කර...

# solutionError
source: Please enter solution
si: කරුණාකර විසඳුම ඇතුළු කරන්න

source: Mark In
si: කාර්යය ආරම්භ කරා

source: Mark Out
si: කාර්යය අවසන් කරා

source: On The Way
si: අතරමඟ

source: Start Work
si: කාර්යය ආරම්භ කරා

source: Mark as Delay
si: කාර්යය ප්‍රමාදවේ

source: Mark as Complete
si: කාර්යය සම්පූර්ණයී

source: Reschedule
si: වෙනත් දිනයක්

source: CLEAR
si: මකන්න

source: Customer's Name
si: පාරිභෝගිකයාගේ නම

# customersNameError
source: Please enter customer's Name
si: කරුණාකර පාරිභෝගිකයාගේ නම ඇතුළත් කරන්න

source: Description
si: විස්තරය

# descriptionError
source: Please enter description
si: කරුණාකර විස්තරය ඇතුළු කරන්න

source: customer signature
si: පාරිභෝගිකයාගෙ අත්සන

# orderBtnName
source: Order New Parts
si: ඇණවුම් කරන්න

# partsFiled
source: New Parts List
si: නව කොටස් ලැයිස්තුව

# partsFiledError
source: Please enter new parts list
si: කරුණාකර නව කොටස් ලැයිස්තුව ඇතුළත් කරන්න

# notimeLinetxt
source: No timeline found
si: කාලරාමුව යාවත් කාලීන වී නොමැත

source: Item Code
si: භාණ්ඩයේ කේතය

source: Item Name
si: භාණ්ඩයේ නම

source: ADD NEW ITEM
si: භාණ්ඩයක් එක්කරන්න

# attendanceMenu
source: Attendance
si: පැමිණීම්

# newItemMenu
source: Add New Item
si: භාණ්ඩයක් එක්කරන්න

source: Item SubCategory
si: භාණ්ඩයේ උප වර්ගය

source: Item Category
si: භාණ්ඩයේ වර්ගය

source: Item Location
si: භාණ්ඩයේ ස්ථානය

# selectUom
source: select
si: ඒකකය තෝරන්න

source: Item max amount
si: උපරිම ප්‍රමාණය

# itemReOderAmount
source: Item re-order Amount
si: නැවත ඇනවුම් මට්ටම

source: Item min Amount
si: අවම ප්‍රමාණය

source: Item Description
si: භාණ්ඩ විස්තරය

# itemCodeError
source: Please enter item code/bin code
si: භාණ්ඩ කේතය ඇතුළත් කරන්න

# itemSubCategoryError
source: Please enter select Sub category
si: භාණ්ඩ උප වර්ගය ඇතුළත් කරන්න

# itemCategoryError
source: Please enter item category
si: භාණ්ඩ වර්ගය ඇතුළත් කරන්න

# itemLocationError
source: Please enter item location
si: භාණ්ඩ ස්ථානය ඇතුළත් කරන්න

# selectUomError
source: Please select UOM
si: ඒකකය තෝරන්න

# pleaseitemDescription
source: Please enter item description
si: භාණ්ඩ විස්තරය ඇතුළත් කරන්න

# itemNameerror
source: Please enter item name
si: භාණ්ඩයේ නම ඇතුළත් කරන්න

# itemMaxAmountError
source: Please enter item max amount
si: උපරිම ප්‍රමාණය ඇතුළත් කරන්න

# itemReOderAmountError
source: Please enter item re-order amount
si: නැවත ඇනවුම් මට්ටම ඇතුළත් කරන්න

# itemMinAmountError
source: Please enter item max amount
si: අවම ප්‍රමාණය ඇතුළත් කරන්න

source: ADD NEW CSR
si: CSR එක්කරන්න

source: Add Item
si: භාණ්ඩය එක්කරන්න

source: Service Area
si: සේවා ප්‍රදේශය

# selectCustomer
source: Please select Customer
si: ගනුදෙනුකරු තෝරන්න

# issueOrRequest
source: Issue/Request
si: ගැටළුව/ඉල්ලීම

# selectServiceType
source: Please select Service Type
si: සේවා වර්ගය තෝරන්න

# selectOwner
source: Please select Owner(primary Contact)
si: අයිතිකරු තෝරන්න

# selectTechnician
source: Please select Technician
si: තාක්ෂණඥයෙකු තෝරන්න

# selectComplexity
source: Please select Complexity
si: ප්‍රමුඛතාවය තෝරන්න

# projectOrTask
source: Project/Task
si: ව්‍යාපෘතිය/කාර්යය

source: Project Serial
si: ව්‍යාපෘති අංකය

source: Project Description
si: ව්‍යාපෘති විස්තරය

source: Customer Name
si: පාරිභෝගිකයාගේ නම

source: Contact Number
si: සම්බන්ධ කරගත හැකි පුද්ගලයාගේ දුරකථන අංකය

source: Contact Persion Name
si: සම්බන්ධ කරගත හැකි පුද්ගලයාගේ නම

# customerAddress
source: Customer Address/Location
si: පාරිභෝගිකයාගේ ලිපිනය/ස්ථානය

# selectProjectPlease
source: Please select project
si: ව්‍යාපෘතිය තෝරන්න

# enterServiceAreaPlease
source: Please enter service area
si: සේවාවේ ප්‍රදේශය ඇතුල් කරන්න

# enterCustomerNamePlease
source: Please enter customer name
si: පාරිභෝගිකයාගේ නම ඇතුල් කරන්න

# enterContactPersonNamePlease
source: Please enter contact person name
si: සම්බන්ධ කරගත හැකි පුද්ගලයාගේ නම ඇතුල් කරන්න

# enterContactNumberPlease
source: Please enter contact number
si: සම්බන්ධ කරගත හැකි අංකය ඇතුල් කරන්න

# enterAddressPlease
source: Please enter address/location
si: ලිපිනය/ස්ථානය ඇතුල් කරන්න

# beDescriptivePlease
source: Please enter be descriptive
si: විස්තරාත්මකව ඇතුල් කරන්න

# enterProjectSerialPlease
source: Please enter project serial
si: ව්‍යාපෘති අනුක්‍රමික අංකය ඇතුල් කරන්න

# enterProjectDetailPlease
source: Please enter project detail
si: ව්‍යාපෘති විස්තරය ඇතුල් කරන්න

# selectCustomerPlease
source: Please select customer
si: පාරිභෝගිකයා තෝරන්න

# selectServiceTypePlease
source: Please select service type
si: සේවා වර්ගය තෝරන්න

# selectOwnerPlease
source: Please select owner
si: අයිතිකරු තෝරන්න

# selectTechnicianPlease
source: Please select technician
si: කාර්මිකය ශිල්පියා තෝරන්න

# selectComplexityPlease
source: Please select complexity
si: ප්‍රමුඛතාවය තෝරන්න

# selectCustomerAddressPlease
source: Please enter customer address
si: පාරිභෝගිකයාගේ ලිපිනය ඇතුලත් කරන්න

# taskEror
source: please enter task
si: කාර්යය ඇතුලත් කරන්න

source: View Projects
si: ව්‍යාපෘති පරීක්ෂා කරන්න

source: No projects or tasks found
si: ව්‍යාපෘති හෝ කාර්යයන් කිසිවක් හමු නොවීය

source: Projects
si: ව්‍යාපෘති

source: Tasks
si: කාර්ය

# workedHoursFormatted
source: wrkd_hours_fmtd
si: වැය වූ වේලාවන්

# grnAndPrn
source: Please Enter GRN Code and PRN Code
si: GRN සහ PRN කේත ඇතුලත් කරන්න

# grnError
source: Please Enter correct GRN Code
si: GRN කේතය ඇතුළත් කරන්න

# prnError
source: Please Enter correct PRN Code
si: PRN කේතය ඇතුළත් කරන්න

# grn
source: GRN Code
si: GRN කේතය

# prn
source: PRN Code
si: PRN කේතය

source: Start
si: ආරම්භ කරන්න

source: Update
si: අප්ඩේට්

source: Finish
si: අවසන් කිරීම

# startworkfirst
source: Please start work first
si: කරුණාකර මුලින්ම වැඩය ආරම්භ කරන්න

# askfinish
source: Are you sure you want to finish work?
si: වැඩය අවසන් කිරීමට ඔබට අවශ්‍ය ද?

# askstart
source: Are you sure you want to start work?
si: වැඩය ආරම්භ කිරීමට අවශ්‍ය ද?
